import 'teachings_data.dart';

const List<Teaching> teachingsList = [
  Teaching(
    title: '修行不是條條大路通羅馬',
    subtitle: '諦深大師開示',
    tag: '應世卷',
    subTag: '破障',
    date: '2018/10/24',
    content: '''坐下弟子及聲聞善知識眾，如來無上尊，教汝等獲智，無智無以修！修之大根本，供養稱之為！,
                是故，釋迦牟尼傳法，文殊普賢而為上首，又稱菩薩首！ 善知識，供養如來，智慧為道！譬如：有人欲供如來，卻供了波旬，落入魔道，無智因者,
                善知識，無始劫來，無量佛出世，何至今者依然云云眾生，罪苦輪迴，皆因：十方一粒米，大如須彌山，吃了不了道，披毛帶角還所致；皆因：十方債主怨，回報如火山，本來一粒米，卻預萬劫難所致，如是成就無始劫、無終難！如是有邪魔外道盛行！,
                是故善知識，應做當供，切勿做不當供，切勿受不當供！,
                善知識，若欲供吾諦深、供妙湛寺建設，當如是知曉並做當供！,
                諦深2018年4月2日應弟子問!''',
  ),
  Teaching(
    title: '諦深大師坐下菩薩戒行與居士行者命終轉後事告知',
    subtitle: '諦深大師開示',
    tag: '應世卷',
    subTag: '',
    date: '2022/03/28',
    content: '''菩薩戒、五戒居士，若命終已往，（有戒牒與居士證者）須將戒牒、居士證交由客堂，經知客報僧值按規矩於戒牒證件做後註並加印封存。
    「後註」項：1.轉世去向（極樂、人道、地獄惡鬼畜生）；2.生前所證；3.有無舍利；4.親屬寄託；5.收回和尚布施之解脫服，若無和尚布施衣物，不宜送之寺院，當自行處理。
    戒牒加印後，按寺院通知，家屬需進寺院參加相關香雲法會！法會內容，若往生極樂世界，行吉祥大法會；若轉人道者，行消災法會；若墮落者，行救拔法會！
    若家屬不參加法會，寺院不予置法。
    妙湛寺客堂 佛曆2565年3月28日網絡知會''',
  ),
  Teaching(
    title: '共業報',
    subtitle: '諦深大師開示',
    tag: '應世卷',
    subTag: '',
    date: '2020/09/21',
    content:
        '''善知識，共業有多種報，其中諸等魔王，能率魔眾，成就諸等國土，共業之者隨業力往去，依據各自緣分、分別成胎。善知識，當知，六道大眾難出苦海，皆因業成法，以法造業，如是成就各自世界。
              2020/9/21應智監代王超居士問。''',
  ),
  Teaching(
    title: '諦深大師寫給誹謗他的僧人的回覆：讓時間變成老天給你的最大的恩賜',
    subtitle: '諦深大師開示',
    tag: '應世卷',
    subTag: '',
    date: '2020/07/13',
    content: '''當你是一個英雄，卻被世間小人玷汙的時候，老兄，別忘了時間將給你最公正的評判！
      當你是一個十足的小人，因為你的狡詐，欺騙了大眾的良知，紅極一時的時候，老兄，別忘了，和你永遠不能分開的時間，一定會給你一個讓你邪惡的靈魂暴曬的——評判！
      做個好人，難嗎？難，很難！
      不管是多麽險惡的人，您都可以隨手做一件好事兒、做很多件好事兒，但是，您的邪惡，絕對不會因為您做了好事兒就變成正義！
      朋友，不管您是個什麽樣的人，把邪惡放下吧！讓時間在您的身上，變得日照九天！
      近期不少人在罵我，請您記住了，只要我活一天，我一定會把擁有邪惡心靈的人按到桶裡，讓普通的人不能受害！不管有多難，我都會一如既往！
      希望時間是老天給你的最大恩賜，而不是最大的懲罰！
      因為你們是凡夫，我就不用佛門名詞給你們回覆了！
      2020/7/13''',
  ),
  Teaching(
    title: '我能你不能',
    subtitle: '諦深大師開示',
    tag: '應世卷',
    subTag: '',
    date: '2019/09/15',
    content: '''善知識聽了，
      我能你不能！
      譬喻造機者，
      其心智學得，
      汝等未學得！
      造機其能者，
      或之未為學，
      不能造機耳，
      是稱你不能！
      佛法不思議，
      難知難決了，
      云何狂妄徒，
      個個稱修行，
      更有罪惡使，
      文字於文章，
      道長短佛門！
      以我諦深說，
      我能你不能！
      於龍宮探藏，
      我能你不能！
      兜率內宮做，
      我能你不能！
      阿彌陀處演，
      我能你不能！
      諦深於佛塔，
      呵斥披袈者，
      我能你不能！
      若汝批其德，
      汝罪無有邊！
      是故你不能！
      諦深於開示，
      呵斥薄戒僧，
      其等為佛子，
      我能你不能！
      若汝亦呵之，
      直接獲重罪！
      若汝不識勸，
      惡報在眼前！
      諸病必加身，
      惡報處處應！
      是故汝不能！
      善者切聽勸，
      我能你不能！
      諦深知來世，
      汝卻妄說之，
      我能你不能！
      諦深有佛通，
      諸事轉佛法，
      我能你不能！
      若吾呵汝罪，
      汝以毀謗我，
      汝必受惡報，
      我能你不能！
      善知識當知，
      莫做大口業，
      一言圖痛快，
      直落地獄罪！
      諦深再告眾，
      我能你不能！
      諦深2019，9，15呵因罪受病者！''',
  ),
  Teaching(
    title: '什麼是有罪居士',
    subtitle: '諦深大師開示',
    tag: '應世卷',
    subTag: '',
    date: '2019/06/02',
    content:
        '''座下弟子及聲聞善知識：皈依三寶者稱為有寶居士，不皈依三寶者，號稱學佛，譬如邪魔外道，既不皈依佛卻自稱學佛或自稱居士者，稱為無寶之人，更稱為重罪或有罪居士，或稱為重罪眾生。
        善知識，有重罪之者以種種詰問，毀、謗、汙、戲之汝等，若不懺悔，將會累世處於地獄、 惡鬼 、 畜生道，難得人身，不遇善法報，是諸人等即使因業轉人，譬如被人殺，轉世做人，亦受種種重罪，諸事不遂。
        善知識，汝等慈悲救度之者，勿與之說，勿觀之行，勿思之過，屆其等披毛戴角為佛門用時，多行救度，令如斯之人能轉罪為善，獲得三寶。
        諦深2019年6月2日
        （諦深大師慈悲做如上開示，因智虹在網上弘法時，有人詰問：「看了昨天師兄發的視頻，視頻中說在家居士三寶是佛、法、父母，如果父母都在，那還好說，若人父母都不在，豈不成了二寶居士？不知師兄意下何解？」）''',
  ),
];