class Teaching {
  final String title;
  final String subtitle;
  final String tag;
  final String subTag;
  final String date;
  final String content;

  const Teaching({
    required this.title,
    required this.subtitle,
    required this.tag,
    required this.subTag,
    required this.date,
    required this.content,
  });
}

const List<Teaching> teachingsList = [
  Teaching(
    title: '修行不是條條大路通羅馬',
    subtitle: '諦深大師開示',
    tag: '應世卷',
    subTag: '破障',
    date: '2018/10/24',
    content: '''坐下弟子及聲聞善知識眾，如來無上尊，教汝等獲智，無智無以修！修之大根本，供養稱之為！,
                是故，釋迦牟尼傳法，文殊普賢而為上首，又稱菩薩首！ 善知識，供養如來，智慧為道！譬如：有人欲供如來，卻供了波旬，落入魔道，無智因者,
                善知識，無始劫來，無量佛出世，何至今者依然云云眾生，罪苦輪迴，皆因：十方一粒米，大如須彌山，吃了不了道，披毛帶角還所致；皆因：十方債主怨，回報如火山，本來一粒米，卻預萬劫難所致，如是成就無始劫、無終難！如是有邪魔外道盛行！,
                是故善知識，應做當供，切勿做不當供，切勿受不當供！,
                善知識，若欲供吾諦深、供妙湛寺建設，當如是知曉並做當供！,
                諦深2018年4月2日應弟子問!''',
  ),
  Teaching(
    title: '修行的真正意義',
    subtitle: '諦深大師開示',
    tag: '應世卷',
    subTag: '破障',
    date: '2018/11/15',
    content: '''坐下弟子及聲聞善知識眾，如來無上尊，教汝等獲智，無智無以修！修之大根本，供養稱之為！,
                是故，釋迦牟尼傳法，文殊普賢而為上首，又稱菩薩首！ 善知識，供養如來，智慧為道！譬如：有人欲供如來，卻供了波旬，落入魔道，無智因者,
                善知識，無始劫來，無量佛出世，何至今者依然云云眾生，罪苦輪迴，皆因：十方一粒米，大如須彌山，吃了不了道，披毛帶角還所致；皆因：十方債主怨，回報如火山，本來一粒米，卻預萬劫難所致，如是成就無始劫、無終難！如是有邪魔外道盛行！,
                是故善知識，應做當供，切勿做不當供，切勿受不當供！,
                善知識，若欲供吾諦深、供妙湛寺建設，當如是知曉並做當供！,
                諦深2018年4月2日應弟子問!''',
  ),
  Teaching(
    title: '修行不是條條大路通羅馬',
    subtitle: '諦深大師開示',
    tag: '應世卷',
    subTag: '破障',
    date: '2018/10/24',
    // 使用 ''' 包含長文本，可以保留換行與排版
    content: '''坐下弟子及聲聞善知識眾，如來無上尊，教汝等獲智，無智無以修！修之大根本，供養稱之為！,
                是故，釋迦牟尼傳法，文殊普賢而為上首，又稱菩薩首！ 善知識，供養如來，智慧為道！譬如：有人欲供如來，卻供了波旬，落入魔道，無智因者,
                善知識，無始劫來，無量佛出世，何至今者依然云云眾生，罪苦輪迴，皆因：十方一粒米，大如須彌山，吃了不了道，披毛帶角還所致；皆因：十方債主怨，回報如火山，本來一粒米，卻預萬劫難所致，如是成就無始劫、無終難！如是有邪魔外道盛行！,
                是故善知識，應做當供，切勿做不當供，切勿受不當供！,
                善知識，若欲供吾諦深、供妙湛寺建設，當如是知曉並做當供！,
                諦深2018年4月2日應弟子問!''',
  ),
  Teaching(
    title: '修行的真正意義',
    subtitle: '諦深大師開示',
    tag: '應世卷',
    subTag: '破障',
    date: '2018/11/15',
    content: '''坐下弟子及聲聞善知識眾，如來無上尊，教汝等獲智，無智無以修！修之大根本，供養稱之為！,
                是故，釋迦牟尼傳法，文殊普賢而為上首，又稱菩薩首！ 善知識，供養如來，智慧為道！譬如：有人欲供如來，卻供了波旬，落入魔道，無智因者,
                善知識，無始劫來，無量佛出世，何至今者依然云云眾生，罪苦輪迴，皆因：十方一粒米，大如須彌山，吃了不了道，披毛帶角還所致；皆因：十方債主怨，回報如火山，本來一粒米，卻預萬劫難所致，如是成就無始劫、無終難！如是有邪魔外道盛行！,
                是故善知識，應做當供，切勿做不當供，切勿受不當供！,
                善知識，若欲供吾諦深、供妙湛寺建設，當如是知曉並做當供！,
                諦深2018年4月2日應弟子問!''',
  ),
  Teaching(
    title: '修行不是條條大路通羅馬',
    subtitle: '諦深大師開示',
    tag: '應世卷',
    subTag: '破障',
    date: '2018/10/24',
    // 使用 ''' 包含長文本，可以保留換行與排版
    content: '''坐下弟子及聲聞善知識眾，如來無上尊，教汝等獲智，無智無以修！修之大根本，供養稱之為！,
                是故，釋迦牟尼傳法，文殊普賢而為上首，又稱菩薩首！ 善知識，供養如來，智慧為道！譬如：有人欲供如來，卻供了波旬，落入魔道，無智因者,
                善知識，無始劫來，無量佛出世，何至今者依然云云眾生，罪苦輪迴，皆因：十方一粒米，大如須彌山，吃了不了道，披毛帶角還所致；皆因：十方債主怨，回報如火山，本來一粒米，卻預萬劫難所致，如是成就無始劫、無終難！如是有邪魔外道盛行！,
                是故善知識，應做當供，切勿做不當供，切勿受不當供！,
                善知識，若欲供吾諦深、供妙湛寺建設，當如是知曉並做當供！,
                諦深2018年4月2日應弟子問!''',
  ),
  Teaching(
    title: '修行的真正意義',
    subtitle: '諦深大師開示',
    tag: '應世卷',
    subTag: '破障',
    date: '2018/11/15',
    content: '''坐下弟子及聲聞善知識眾，如來無上尊，教汝等獲智，無智無以修！修之大根本，供養稱之為！,
                是故，釋迦牟尼傳法，文殊普賢而為上首，又稱菩薩首！ 善知識，供養如來，智慧為道！譬如：有人欲供如來，卻供了波旬，落入魔道，無智因者,
                善知識，無始劫來，無量佛出世，何至今者依然云云眾生，罪苦輪迴，皆因：十方一粒米，大如須彌山，吃了不了道，披毛帶角還所致；皆因：十方債主怨，回報如火山，本來一粒米，卻預萬劫難所致，如是成就無始劫、無終難！如是有邪魔外道盛行！,
                是故善知識，應做當供，切勿做不當供，切勿受不當供！,
                善知識，若欲供吾諦深、供妙湛寺建設，當如是知曉並做當供！,
                諦深2018年4月2日應弟子問!''',
  ),
];
